import Title from "components/UI/atoms/Title";

export default function Intro() {
  return (
    <section className="mb-4">
      <Title title="소개" />
      <p>
        2년차 개발자로 스타트업에서 프론트엔드 개발 및 배포 업무를 맡았습니다.
        2년동안 Vue.js, Nuxt.js, Angular2, React, Next.js, Svelte, Sveltekit
        여러 프레임 워크로 만들어진 프로젝트에 메인 및 서브 개발자로 참여한
        이력이 있습니다. 회사가 인수합병되거나, 서비스를 새롭게 시작하는 여러
        상황으로 인하여 다양한 프레임워크를 실전에 사용하였고, 그 덕분에 어떤
        것을 쓰더라도 실전에 소화할 수 있다는 자신감을 얻을 수 있었습니다.
        <br />
        <br />
        사람에게 긍적적인 영향을 받고, 배움을 얻을 수 있다는 것을 알고 있기에
        동료들과 협업하는 것을 좋아합니다. 많은 '스터디 그룹'에 참여한 경험을
        갖고 있던 회사 동료와 북 클럽을 진행한 적이 있었습니다. 스프레드 시트를
        이용하여 주제에 대해 토의를 하는 방식으로 사람들의 의견을 이끌어내는
        그분의 그룹 운영 방식에 매력을 느꼈습니다. 그래서 그 분의 도움을 받아
        이번에는 제 주도하에 마음에 맞는 사람들을 모아 '개발 스터디'를 운영하며
        정기적으로 자기계발에 기여하기 위해 노력하고 있습니다.
      </p>
    </section>
  );
}
